### Goal
Summarise every exercise of SQL Bolt website and reproduce them in Python

In [1]:
import pandas as pd
import numpy as np

pd.set_option("display.max_rows",100)

### SQL Lesson 1: SELECT queries 101

- Find the title of each film
```mysql
SELECT Title FROM movies;
```
- Find the director of each film
```mysql
SELECT Director FROM movies;
```
- Find the title and director of each film
```mysql
SELECT Title, Director FROM movies;
```
- Find the title and year of each film
```mysql
SELECT Title, Year FROM movies;
```
- Find all the information about each film
```mysql
SELECT * FROM movies;
```

In [2]:
# import CSV
movies = pd.read_csv("data/movies.csv")

In [3]:
# find Title of each film (serie)
movies.Title

0               Toy Story
1            A Bug's Life
2             Toy Story 2
3          Monsters, Inc.
4            Finding Nemo
5         The Incredibles
6                    Cars
7             Ratatouille
8                  WALL-E
9                      Up
10            Toy Story 3
11                 Cars 2
12                  Brave
13    Monsters University
14                 WALL-G
Name: Title, dtype: object

In [4]:
# find Title and year (DataFrame)
movies[["Title","Year"]]

                  Title  Year
0             Toy Story  1995
1          A Bug's Life  1998
2           Toy Story 2  1999
3        Monsters, Inc.  2001
4          Finding Nemo  2003
5       The Incredibles  2004
6                  Cars  2006
7           Ratatouille  2007
8                WALL-E  2008
9                    Up  2009
10          Toy Story 3  2010
11               Cars 2  2011
12                Brave  2012
13  Monsters University  2013
14               WALL-G  2042

In [5]:
# set Id as index in the df
movies = movies.set_index("Id")

### SQL Lesson 2: Queries with constraints (Pt. 1)

- Find the movie with a row id of 6
```mysql
SELECT * FROM movies
WHERE Id = 6;
```
- Find the movies released in the years between 2000 and 2010
```mysql
SELECT * FROM movies
WHERE year BETWEEN 2000 AND 2010;
```
- Find the movies not released in the years between 2000 and 2010
```mysql
SELECT * FROM movies
WHERE year NOT BETWEEN 2000 AND 2010;
```
- Find the first 5 Pixar movies and their release year
```mysql
SELECT * FROM movies
ORDER BY Year
LIMIT 5;
```

In [6]:
# find movie with Id 6
movies.iloc[6]

Title                      Cars
Director          John Lasseter
Year                       2006
Length_minutes              117
Name: 7, dtype: object

In [7]:
# find movies between 2000 and 2010
movies.loc[movies["Year"].ge(2000)&movies["Year"].le(2010)]

              Title        Director  Year  Length_minutes
Id
4    Monsters, Inc.     Pete Docter  2001              92
5      Finding Nemo  Andrew Stanton  2003             107
6   The Incredibles       Brad Bird  2004             116
7              Cars   John Lasseter  2006             117
8       Ratatouille       Brad Bird  2007             115
9            WALL-E  Andrew Stanton  2008             104
10               Up     Pete Docter  2009             101
11      Toy Story 3     Lee Unkrich  2010             103

In [8]:
# find movies not between 2000 and 2010
movies.loc[movies["Year"].le(1999)|movies["Year"].ge(2011)]

                  Title        Director  Year  Length_minutes
Id
1             Toy Story   John Lasseter  1995              81
2          A Bug's Life   John Lasseter  1998              95
3           Toy Story 2   John Lasseter  1999              93
12               Cars 2   John Lasseter  2011             120
13                Brave  Brenda Chapman  2012             102
14  Monsters University     Dan Scanlon  2013             110
87               WALL-G  Brenda Chapman  2042              97

In [9]:
# find first 5 movies from Pixar
movies.sort_values(by=["Year"]).head(5)

             Title        Director  Year  Length_minutes
Id
1        Toy Story   John Lasseter  1995              81
2     A Bug's Life   John Lasseter  1998              95
3      Toy Story 2   John Lasseter  1999              93
4   Monsters, Inc.     Pete Docter  2001              92
5     Finding Nemo  Andrew Stanton  2003             107

### SQL Lesson 3: Queries with constraints (Pt. 2)
- Find all the Toy Story movies
```mysql
SELECT * FROM movies
WHERE Title LIKE "Toy Story%";
```
- Find all the movies directed by John Lasseter
```mysql
SELECT * FROM movies
WHERE Director = "John Lasseter";
```
- Find all the movies (and director) not directed by John Lasseter
```mysql
SELECT * FROM movies
WHERE Director != "John Lasseter";
```
- Find all the WALL-* movies
```mysql
SELECT * FROM movies
WHERE Title LIKE "WALL-%";
```

In [10]:
# find Toy Story movies
movies[movies["Title"].str.contains("Toy Story")]

          Title       Director  Year  Length_minutes
Id
1     Toy Story  John Lasseter  1995              81
3   Toy Story 2  John Lasseter  1999              93
11  Toy Story 3    Lee Unkrich  2010             103

In [11]:
# find movies not directed by John Lasseter
# ~ negative of the series
movies[~movies["Director"].str.contains("John Lasseter")]

                  Title        Director  Year  Length_minutes
Id
4        Monsters, Inc.     Pete Docter  2001              92
5          Finding Nemo  Andrew Stanton  2003             107
6       The Incredibles       Brad Bird  2004             116
8           Ratatouille       Brad Bird  2007             115
9                WALL-E  Andrew Stanton  2008             104
10                   Up     Pete Docter  2009             101
11          Toy Story 3     Lee Unkrich  2010             103
13                Brave  Brenda Chapman  2012             102
14  Monsters University     Dan Scanlon  2013             110
87               WALL-G  Brenda Chapman  2042              97

### SQL Lesson 4: Filtering and sorting Query results
- List all directors of Pixar movies (alphabetically), without duplicates
```mysql
SELECT DISTINCT Director FROM movies
ORDER BY Director;
```
- List the last four Pixar movies released (ordered from most recent to least)
```mysql
SELECT Title FROM movies
ORDER BY Year DESC
LIMIT 4;
```
- List the first five Pixar movies sorted alphabetically
```mysql
SELECT Title FROM movies
ORDER BY Title ASC
LIMIT 5;
```
- List the next five Pixar movies sorted alphabetically
```mysql
SELECT Title FROM movies
ORDER BY Title ASC
LIMIT 5
OFFSET 5;
```

In [23]:
# unique Directors alphabetically
list(movies.sort_values(by="Director").Director.unique())

['Andrew Stanton',
 'Brad Bird',
 'Brenda Chapman',
 'Dan Scanlon',
 'John Lasseter',
 'Lee Unkrich',
 'Pete Docter']

In [25]:
# Last for movies
movies.sort_values(by="Year", ascending = False).head(4)

                  Title        Director  Year  Length_minutes
Id
87               WALL-G  Brenda Chapman  2042              97
14  Monsters University     Dan Scanlon  2013             110
13                Brave  Brenda Chapman  2012             102
12               Cars 2   John Lasseter  2011             120

In [33]:
# movies 6 to 10 alphabetically -- position 5 because python starts from 0
movies.sort_values(by="Title").iloc[5:10]

                  Title       Director  Year  Length_minutes
Id
14  Monsters University    Dan Scanlon  2013             110
4        Monsters, Inc.    Pete Docter  2001              92
8           Ratatouille      Brad Bird  2007             115
6       The Incredibles      Brad Bird  2004             116
1             Toy Story  John Lasseter  1995              81

### SQL Review: Simple SELECT Queries
- List all the Canadian cities and their populations
```mysql
SELECT City, Population FROM north_american_cities
WHERE Country = "Canada";
```
- Order all the cities in the United States by their latitude from north to south
```mysql
SELECT * FROM north_american_cities
WHERE Country = "United States"
ORDER BY Latitude DESC;
```
- List all the cities west of Chicago, ordered from west to east
```mysql
SELECT city, longitude FROM north_american_cities
WHERE
Longitude < (
    SELECT Longitude FROM north_american_cities
    WHERE City = "Chicago")
ORDER BY Longitude ASC;
```
- List the two largest cities in Mexico (by population)
```mysql
SELECT City, Population FROM north_american_cities
WHERE
Country = "Mexico" 
ORDER BY Population DESC
LIMIT 2;
```
- List the third and fourth largest cities (by population) in the United States and their population
```mysql
SELECT City, Population FROM north_american_cities
WHERE
Country = "United States" 
ORDER BY Population DESC
LIMIT 2
OFFSET 2;
```

In [35]:
# import CSV
cities = pd.read_csv("data/north_american_cities.csv")
cities

                   City        Country  Population   Latitude   Longitude
0           Guadalajara         Mexico     1500800  20.659699 -103.349609
1               Toronto         Canada     2795060  43.653226  -79.383184
2               Houston  United States     2195914  29.760427  -95.369803
3              New York  United States     8405837  40.712784  -74.005941
4          Philadelphia  United States     1553165  39.952584  -75.165222
5                Havana           Cuba     2106146  23.054070  -82.345189
6           Mexico City         Mexico     8555500  19.432608  -99.133208
7               Phoenix  United States     1513367  33.448377 -112.074037
8           Los Angeles  United States     3884307  34.052234 -118.243685
9   Ecatepec de Morelos         Mexico     1742000  19.601841  -99.050674
10             Montreal         Canada     1717767  45.501689  -73.567256
11              Chicago  United States     2718782  41.878114  -87.629798

In [38]:
# canadian cities by population
cities[cities["Country"].eq("Canada")][["City","Population"]].sort_values(by="Population")

        City  Population
10  Montreal     1717767
1    Toronto     2795060

In [40]:
# us cities north to south
cities[cities["Country"].eq("United States")].sort_values(by="Latitude", ascending=False)

            City        Country  Population   Latitude   Longitude
11       Chicago  United States     2718782  41.878114  -87.629798
3       New York  United States     8405837  40.712784  -74.005941
4   Philadelphia  United States     1553165  39.952584  -75.165222
8    Los Angeles  United States     3884307  34.052234 -118.243685
7        Phoenix  United States     1513367  33.448377 -112.074037
2        Houston  United States     2195914  29.760427  -95.369803

In [42]:
# cities west of Chicago (longitude < -88), from west to east
cities[cities["Longitude"].le(-88)].sort_values(by="Longitude")

                  City        Country  Population   Latitude   Longitude
8          Los Angeles  United States     3884307  34.052234 -118.243685
7              Phoenix  United States     1513367  33.448377 -112.074037
0          Guadalajara         Mexico     1500800  20.659699 -103.349609
6          Mexico City         Mexico     8555500  19.432608  -99.133208
9  Ecatepec de Morelos         Mexico     1742000  19.601841  -99.050674
2              Houston  United States     2195914  29.760427  -95.369803

In [46]:
# third and fourth largest cities in US
(cities[cities["Country"].eq("United States")]
                         .sort_values(by="Population", ascending=False)
                         .iloc[2:4])

       City        Country  Population   Latitude  Longitude
11  Chicago  United States     2718782  41.878114 -87.629798
2   Houston  United States     2195914  29.760427 -95.369803

### SQL Lesson 6: Multi-table queries with JOINs
- Find the domestic and international sales for each movie
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id;
```
- Show the sales numbers for each movie that did better internationally rather than domestically
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id
WHERE International_sales > Domestic_sales;
```
- List all the movies by their ratings in descending order
```mysql
SELECT * FROM movies
JOIN boxoffice
    ON Id = Movie_Id
ORDER BY Rating DESC;
```

In [48]:
# import CSV
movies = pd.read_csv("data/movies.csv")
boxoffice = pd.read_csv("data/boxoffice.csv")

boxoffice

    Movie_id  Rating  Domestic_sales  International_sales
0          5     8.2       380843261            555900000
1         14     7.4       268492764            475066843
2          8     8.0       206445654            417277164
3         12     6.4       191452396            368400000
4          3     7.9       245852179            239163000
5          6     8.0       261441092            370001000
6          9     8.5       223808164            297503696
7         11     8.4       415004880            648167031
8          1     8.3       191796233            170162503
9          7     7.2       244082982            217900167
10        10     8.3       293004164            438338580
11         4     8.1       289916256            272900000
12         2     7.2       162798565            200600000
13        13     7.2       237283207            301700000

In [51]:
# domestic and international sales of each movie
movies.merge(boxoffice, left_on="Id", right_on="Movie_id")[["Title", "Domestic_sales", "International_sales"]]

                  Title  Domestic_sales  International_sales
0             Toy Story       191796233            170162503
1          A Bug's Life       162798565            200600000
2           Toy Story 2       245852179            239163000
3        Monsters, Inc.       289916256            272900000
4          Finding Nemo       380843261            555900000
5       The Incredibles       261441092            370001000
6                  Cars       244082982            217900167
7           Ratatouille       206445654            417277164
8                WALL-E       223808164            297503696
9                    Up       293004164            438338580
10          Toy Story 3       415004880            648167031
11               Cars 2       191452396            368400000
12                Brave       237283207            301700000
13  Monsters University       268492764            475066843

In [61]:
# movies with more international than domestic sales
mo = movies.merge(boxoffice, left_on="Id", right_on="Movie_id")

mo.loc[mo["Domestic_sales"].le(mo["International_sales"])][["Title", "Domestic_sales", "International_sales"]]

                  Title  Domestic_sales  International_sales
1          A Bug's Life       162798565            200600000
4          Finding Nemo       380843261            555900000
5       The Incredibles       261441092            370001000
7           Ratatouille       206445654            417277164
8                WALL-E       223808164            297503696
9                    Up       293004164            438338580
10          Toy Story 3       415004880            648167031
11               Cars 2       191452396            368400000
12                Brave       237283207            301700000
13  Monsters University       268492764            475066843

In [63]:
mo[["Title", "Rating"]].sort_values(by="Rating", ascending=False)

                  Title  Rating
8                WALL-E     8.5
10          Toy Story 3     8.4
0             Toy Story     8.3
9                    Up     8.3
4          Finding Nemo     8.2
3        Monsters, Inc.     8.1
5       The Incredibles     8.0
7           Ratatouille     8.0
2           Toy Story 2     7.9
13  Monsters University     7.4
1          A Bug's Life     7.2
6                  Cars     7.2
12                Brave     7.2
11               Cars 2     6.4

### SQL Lesson 7: OUTER JOINs
- Find the list of all buildings that have employees
```mysql
SELECT Building FROM employees
GROUP BY Building;
```
- Find the list of all buildings and their capacity
```mysql
SELECT * FROM Buildings;
```
- List all buildings and the distinct employee roles in each building (including empty buildings)
```mysql
SELECT Building_name, Role FROM Buildings
LEFT JOIN Employees
    ON Building_name = Building
GROUP BY 1,2;
```
--- ALTERNATIVE
```mysql
SELECT DISTINCT building_name, role 
FROM buildings 
  LEFT JOIN employees
    ON building_name = building;
```

### SQL Lesson 8: A short note on NULLs
- Find the name and role of all employees who have not been assigned to a building
```mysql
SELECT * FROM employees
WHERE Building IS NULL;
```
- Find the names of the buildings that hold no employees
```mysql
SELECT DISTINCT Building_name FROM Buildings
LEFT JOIN Employees
    ON Building_name = Building
WHERE Role IS NULL;
```

### SQL Lesson 9: Queries with expressions
- List all movies and their combined sales in millions of dollars
```mysql
SELECT 
    Title,
    (Domestic_sales + International_sales)/1000000 AS "sales (Mio)"
FROM movies
JOIN Boxoffice
    ON Id = Movie_Id;
````
- List all movies and their ratings in percent
```mysql
SELECT 
    title, 
    Rating*10 AS Ratings  
FROM movies
  JOIN boxoffice
    ON movies.id = boxoffice.movie_id;
```
- List all movies that were released on even number years
```mysql
SELECT title, year  
FROM movies
WHERE Year%2 = 0;
```

### SQL Lesson 10: Queries with aggregates (Pt. 1)
- Find the longest time that an employee has been at the studio
```mysql
SELECT MAX(Years_employed) FROM employees;
```
- For each role, find the average number of years employed by employees in that role
```mysql
SELECT 
    Role,
    AVG(Years_employed) AS Avg_years
FROM employees
GROUP BY Role;
```
- Find the total number of employee years worked in each building
```mysql
SELECT 
    Building,
    SUM(Years_employed) AS Total_years
FROM employees
GROUP BY Building;
```

### SQL Lesson 11: Queries with aggregates (Pt. 2)
- Find the number of Artists in the studio (without a HAVING clause)
```mysql
SELECT count(role) 
FROM employees
WHERE Role = "Artist";
```
- Find the number of Employees of each role in the studio
```mysql
SELECT Role, count(role) 
FROM employees
GROUP BY Role;
```
- Find the total number of years employed by all Engineers
```mysql
SELECT Role, SUM(Years_employed)
FROM employees
WHERE Role = "Engineer"
```

### SQL Lesson 12: Order of execution of a Query
- Find the number of movies each director has directed
```mysql
SELECT Director, count(Title)
FROM movies
GROUP BY Director
ORDER BY 2 DESC;
```
- Find the total domestic and international sales that can be attributed to each director
```mysql
SELECT Director, SUM(Domestic_sales + International_sales)
FROM movies
JOIN Boxoffice
    ON Id = Movie_Id
GROUP BY Director
ORDER BY 2 DESC;
```

### SQL Lesson 13: Inserting rows
- Add the studio's new production, Toy Story 4 to the list of movies (you can use any director)
```mysql
INSERT INTO Movies
VALUES (20, "Toy Story 4", "Josh Cooley", 2019, 100)
```
- Toy Story 4 has been released to critical acclaim! It had a rating of 8.7, and made 340 million domestically and 270 million internationally. Add the record to the BoxOffice table.
```mysql
INSERT INTO Boxoffice
VALUES (20, 8.7, 340000000, 270000000)
```

### SQL Lesson 14: Updating rows
- The director for A Bug's Life is incorrect, it was actually directed by John Lasseter
```mysql
UPDATE Movies
SET Director = "John Lasseter"
WHERE Id = 2
```
- The year that Toy Story 2 was released is incorrect, it was actually released in 1999
```mysql
UPDATE Movies
SET Year = 1999
WHERE Id = 3
```
- Both the title and director for Toy Story 8 is incorrect! The title should be "Toy Story 3" and it was directed by Lee Unkrich
```mysql
UPDATE Movies
SET
    Title = "Toy Story 3",
    Director = "Lee Unkrich"
WHERE Id = 11
```

### SQL Lesson 15: Deleting rows
- This database is getting too big, lets remove all movies that were released before 2005.
```mysql
DELETE FROM Movies
WHERE Year < 2005;
```
- Andrew Stanton has also left the studio, so please remove all movies directed by him.
```mysql
DELETE FROM Movies
WHERE Director = "Andrew Stanton"
```

### SQL Lesson 16: Creating tables
Create a new table named Database with the following columns:
 Name A string (text) describing the name of the database
 Version A number (floating point) of the latest version of this database
 Download_count An integer count of the number of times this database was downloaded
This table has no constraints.
```mysql
CREATE TABLE Database (
    Name TEXT,
    Version FLOAT,
    Download_count INTEGER
);
```

### SQL Lesson 17: Altering tables
- Add a column named Aspect_ratio with a FLOAT data type to store the aspect-ratio each movie was released in.
```mysql
ALTER TABLE Movies
ADD Aspect_ratio FLOAT
```
- Add another column named Language with a TEXT data type to store the language that the movie was released in. Ensure that the default for this language is English.
```mysql
ALTER TABLE Movies
ADD Language TEXT
    DEFAULT "English"
```

### SQL Lesson 18: Dropping tables
- We've sadly reached the end of our lessons, lets clean up by removing the Movies table
```mysql
DROP TABLE IF EXISTS Movies;
```
- And drop the BoxOffice table as well
```mysql
DROP TABLE IF EXISTS Boxoffice;
```